
"keyYes"							= "Yes";
"keyNo"								= "No";
"keyOK"								= "OK";
"keyRequired"						= "Required";
"keyNone"							= "None";

"keyPairedDevicesTitle"				= "Paired Devices:";
"keyFavoriteDevicesTitle"			= "Favorite Devices:";
"keyConnectedDevicesTitle"			= "Connected Devices:";
"keyUnknownDevice"					= "Unknown Device";
"keyErrorOccurred"					= "An error occurred. (0x%x)";
"keyNotAvailable"					= "Not available.";
"keyNameNotAvailable"				= "Name not available";
"keyNoDevicePresent"				= "No Bluetooth device present.";

"keyPrefReadErrorTitle"				= "An error occurred reading the Bluetooth preferences.";
"keyPrefReadErrorDesc"				= "The Bluetooth configuration on this computer appears to be invalid. Reinstall the Bluetooth software and try again.";

"keyUnacceptablePathTitle"			= "The specified path is not acceptable.";
"keyUnacceptablePathDesc"			= "The specified path is not valid for use by Bluetooth Object Exchange. This is most likely because you do not have write permissions on the destination directory. Specify another.";

"keyPathWarningTitle"				= "The folder you specified is not recommended.";
"keyPathWarningDesc"				= "The folder may be locked or you may not have permission to read from or write to it.";

"keyPrefSaveErrorTitle"				= "An error occurred saving the Bluetooth preferences.";
"keyPrefSaveErrorDesc"				= "Some Bluetooth preferences could not be saved. The Bluetooth device is probably not available to this computer.";

"keyPortInUseTitle"					= "The port is currently in use.";
"keyPortInUseDelete"				= "You are attempting to remove a port which is in use. Quit the application using this port and try again.";
"keyPortInUseEdit"					= "You are attempting to modify a port which is in use. Quit the application using this port and try again.";

"kServiceCannotBeModifiedKey"		= "The service cannot be modified.";
"kPortCannotBeCreatedOrModifiedKey"	= "An error occurred attempting to create or modify the port.";

"keyTTYNameAlreadyInUse"			= "Name already in use";
"keyTTYNameInUseText"				= "The port name you have chosen is already in use. Choose a different name.";

"kTTYSerialPortKey"					= "SerialPort";	/* One word, no spaces, no special caracters, only ASCII from 'a' to 'z' and 'A' to 'Z' no extra alphabets, this becomes a TTY name !! */
"kBluetoothSerialPortKey"			= "Serial Port";
"kBluetoothSerialPortOnKey"			= "Bluetooth Serial Port On";
"kBluetoothSerialPortOffKey"		= "Bluetooth Serial Port Off";
"kEditSerialPorts"					= "Edit Serial Ports…";
"kSerialPortKey"					= "Serial Port";
"kSerialPortOnKey"					= "Serial Port On";
"kSerialPortOffKey"					= "Serial Port Off";
"kOtherKey"							= "Other…";
"kBluetoothFileExchangeKey"			= "File Exchange";
"kBluetoothFileExchangeOnKey"		= "Bluetooth File Exchange On";
"kBluetoothFileExchangeOffKey"		= "Bluetooth File Exchange Off";
"kBluetoothFileTransferKey"			= "File Transfer";
"kBluetoothFileTransferOnKey"		= "Bluetooth File Transfer On";
"kBluetoothFileTransferOffKey"		= "Bluetooth File Transfer Off";

"kBluetoothRemoteControlKey"		= "Remote Control";
"kBluetoothRemoteControlOnKey"		= "Bluetooth Remote Control On";
"kBluetoothRemoteControlOffKey"		= "Bluetooth Remote Control Off";

"kBluetoothPANServiceKey"			= "Personal Area Network";
"kBluetoothPANServiceOnKey"			= "Bluetooth Personal Area Network On";
"kBluetoothPANServiceOffKey"		= "Bluetooth Personal Area Network Off";

"kDeviceNameTitle"					= "“%@” is the name Bluetooth devices use to connect to this computer.";

"kInKey"							= "In";		/* Short for Incoming */
"kOutKey"							= "Out";	/* Short for Outgoing */

"kEllipsisString"						= "…";
"kPower"								= "Power";
"kBluetoothPower"						= "Bluetooth Power";
"kBluetoothPowerOn"						= "Bluetooth On";
"kBluetoothPowerOff"					= "Bluetooth Off";
"kBluetoothPowerIsOff"					= "Bluetooth power is off. To use Bluetooth, first you must turn it on.";
"kTurnBTOff"							= "Turn Bluetooth Off";
"kTurnBTOn"								= "Turn Bluetooth On";
"kVersionKey"							= "(Version: %d.%d.%d%c%d)";
"kOnKey"								= "On";
"kCancelKey"							= "Cancel";
"kOffKey"								= "Off";
"kNever"								= "Never";

"kIsConnected"							= "Connected";
"kIsNotConnected"						= "Not Connected";

"kAddToFavoritesKey"					= "Add to Favorites";
"kRemoveFromFavoritesKey"				= "Remove from Favorites";

"kRenameDeviceKey"						= "Rename";

"kBluetoothSetupDevice"					= "Set up this device…";
"kDisconnectDevice"						= "Disconnect";
"kResetDevice"							= "Factory Reset This Device";
"kConnectDevice"						= "Connect";
"kConfigureDevice"						= "Configure this device…";
"kMoreInfo"								= "Show More Info";
"kHideMoreInfo"							= "Hide More Info";
"kNoDevicesKey"							= "No Devices";

"kDeviceNameKey"						= "Name";
"kDeviceAddressKey"						= "Address";
"kDeviceTypeKey"						= "Type";
"kDeviceServicesKey"					= "Services";
"kOtherServices"						= "Other Services";
"kUnknownService"						= "Unknown Service";

"kPairedHeaderKey"						= "Paired";
"kConfiguredHeaderKey"					= "Configured";
"kFavoriteHeaderKey"					= "Favorite";
"kConnectedHeaderKey"					= "Connected";
"kSerialPortsHeaderKey"					= "Serial Ports";
"kSerialPortsHeaderDeviceService"		= "Device Service";
"kSerialPortsHeaderPortType"			= "Port Protocol";
"kSerialPortDirectionIncoming"			= "Incoming";
"kSerialPortDirectionOutgoing"			= "Outgoing";

"kSerialPortHeadingOutgoing"			= "Select a serial port outgoing to the device to modify its settings";
"kSerialPortHeadingIncoming"			= "Select a serial port incoming to this machine to modify its settings";

"kHIDDeviceDeleteKeyboardPairingWarning"		= "This is the only keyboard connected to your computer. If you remove this keyboard you will no longer have access to it. Are you sure you want to remove it?";
"kHIDDeviceDeleteMousePairingWarning"			= "This is the only pointing device connected to your computer. If you remove this mouse from the list, you won’t be able to use it. Are you sure you want to remove it?";
"kHIDDeviceDeleteTrackpadPairingWarning"		= "This is the only pointing device connected to your computer. If you remove this trackpad from the list, you won’t be able to use it. Are you sure you want to remove it?";
"kHIDDeviceKeyboard"					= "keyboard";
"kHIDDeviceMouse"						= "mouse";

"kDiscoverableTooltip"		= "If this is disabled, unknown Bluetooth devices will no longer be able to find your computer. Devices that are already paired will still be able to connect to your computer.";

"kOptionIsAvailable"		= "Available";
"kAvailableServiceTurnOn"	= "Turn Service On";
"kAvailableServiceTurnOff"	= "Turn Service Off";

"kOptionPairing"			= "Requires Pairing";
"kPairingRequired"			= "Require Pairing";
"kPairingNotRequired"		= "Do not require Pairing";

"kOptionReceiveBehavior"	= "When receiving files:";
"kReceiveBehaviorAccept"	= "Accept without warning";
"kReceiveBehaviorPrompt"	= "Prompt for each file";

"kOptionHandlePIMItem"		= "When PIM items are received:";
"kOptionHandleOtherItem"	= "When other items are received:";
"kHandleItemSave"			= "Save";
"kHandleItemOpen"			= "Open";
"kHandleItemAsk"			= "Ask";

"kOptionReceiveFolder"		= "Receive Folder";
"kReceiveFolderChoose"		= "Other…";

"kOptionFolderForBrowse"	= "Folder other devices can browse";

"kOptionName"				= "Name:";
"kOptionShowInNetworkPrefs"	= "Show in Network Preferences:";
"kOptionType"				= "Type:";
"kOptionTypeModem"			= "Modem";
"kOptionTypeRS232"			= "RS-232";


"kOptionEditSerialPortName"	= "Edit port name…";
"kOptionAddSerialPort"		= "Add serial port";
"kOptionRemoveSerialPort"	= "Remove serial port";

"kButtonAddDevice"			= "Setup new device";
"kButtonRemoveDevice"		= "Delete selected device";
"kButtonDeviceOptions"		= "Perform tasks with the selected device";
"kBluetoothDevices"			= "Bluetooth Devices";

"kOptionMajorClass"			= "Major Device Class";
"kOptionMinorClass"			= "Minor Device Class";
"kOptionServiceClass"		= "Device Service Class";
"kOptionLastNameUpdate"		= "Last Name Update";
"kOptionLastInquiryUpdate"	= "Last Inquiry Update";
"kOptionLastServicesUpdate"	= "Last Services Update";
"kOptionProductID"			= "Product ID";
"kOptionVendorID"			= "Vendor ID";

"kPerformSDPQueryKey"				= "Update Device Services";
"kPerformNameRequestKey"			= "Update Device Name";

"kOpenBTPrefsKey"					= "Open Bluetooth Preferences…";
"kMousePreferences"					= "Open Mouse Preferences…";
"kKeyboardPreferences"				= "Open Keyboard Preferences…";
"kOpenPrintPrefsKey"				= "Open Printer Preferences…";
"kOpenSoundPrefsKey"				= "Open Sound Preferences…";
"kSendFileToDevice"					= "Send File…";
"kBrowseDevice"						= "Browse Device…";

"kTurnOnHeadphones"					= "Use as Audio Device (Stereo)";
"kTurnOffHeadphones"				= "Don’t Use as Audio Device";
"kTurnOnHeadset"					= "Use as Audio Device (Mono)";
"kTurnOffHeadset"					= "Don’t Use as Audio Device";

"kSyncDevice"						= "Sync…";

"kOpenBTSAKey"						= "Set up Bluetooth Device…";
"kBTSendFileKey"					= "Send File…";
"kBTGetFileKey"						= "Browse Device…";

"kJoinNetwork"						= "Connect to Network";
"kKeyDisconnectFromNetwork"			= "Disconnect from Network";
"kRemoveDevice"						= "Remove This Device";
"kDeviceOptions"					= "device options";
"kDeviceNamed"						= "device named %@";

"kOptionConfirm"					= "Are you sure you want to deselect this checkbox?";
"kOptionAutoBTSAWarning"			= "Make sure you have a USB input device available in case your wireless keyboard or mouse are unavailable at startup.";
	
